src/cf/Catalogs/КлассификаторЕдиницИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассификаторЕдиницИзмерения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзмеряемойВеличины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/КлассификаторЕдиницИзмерения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает дерево значений с данными Общероссийского классификатора единиц измерения (ОКЕИ).
//
// Возвращаемое значение:
//  ДеревоЗначений - Дерево значений с колонками "Код", "Наименование" и "МеждународноеСокращение".
//
Функция ПолучитьДанныеКлассификатора() Экспорт
	
	Текст = Новый ТекстовыйДокумент;
	Текст = ПолучитьМакет("КлассификаторЕдиницИзмерения");
	ТекстМакета = Текст.ПолучитьТекст();
	
	Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(ТекстМакета);
	
КонецФункции

// Выполняет поиск единицы измерения в справочнике "КлассификаторЕдиницИзмерения"
// если элемент в справочнике не найден, осуществляется попыка добавления элемента из ОКЕИ,
// если в ОКЕИ элемент не найден, то он не создается!
//
// Параметры:
// КодПоОКЕИ - Строка - код единицы измерения по ОКЕИ (обязательный)
//
// Возвращаемое значение:
//   Неопределено - если поиск не дал результатов
//   СправочникСсылка.КлассификаторЕдиницИзмерения - если поиск успешен
// 
Функция ЕдиницаИзмеренияПоКоду(КодПоОКЕИ) Экспорт

	// Если кодПоОКЕИ не заполнен то воврат
	Если НЕ ЗначениеЗаполнено(КодПоОКЕИ) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	// Сначала попытаемся найти единицу среди уже существующих в справочнике
	ЕдиницаИзмерения = НайтиПоКоду(КодПоОКЕИ);
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда 
		Возврат ЕдиницаИзмерения;
	КонецЕсли;
		
	ТаблицаКлассификатораЕдиницИзмерения = ТаблицаКлассификатораЕдиницИзмерения();
	СтруктураПоиска = Новый Структура("КодЧисловой", КодПоОКЕИ);
	СтрокиТаблицы = ТаблицаКлассификатораЕдиницИзмерения.НайтиСтроки(СтруктураПоиска);
	Если СтрокиТаблицы.Количество() > 0 Тогда
		НоваяЕдиницаИзмерения = СоздатьЭлемент();
		ЗаполнитьОбъектЕдиницыИзмерения(НоваяЕдиницаИзмерения, СтрокиТаблицы[0]);
		Попытка
			НоваяЕдиницаИзмерения.Записать();
			Возврат НоваяЕдиницаИзмерения.Ссылка;
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция формирует таблицу значений классификатора единиц измерения.
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица классификатора единиц измерения с колонками:
//    * Наименование - Строка - наименование единицы измерения;
//    * КодЧисловой - Строка - числовой код единицы измерения;
//    * ТипИзмеряемойВеличины - Строка - тип измеряемой величины;
//    * УсловноеОбозначениеНациональное - Строка - условное обозначение национальное;
//    * УсловноеОбозначениеМеждународное - Строка - условное обозначение международное;
//    * КодовоеБуквенноеОбозначениеНациональное - Строка - кодовое буквенное обозначение национальное;
//    * КодовоеБуквенноеОбозначениеМеждународное - Строка - кодовое буквенное обозначение международное.
Функция ТаблицаКлассификатораЕдиницИзмерения() Экспорт
	
	ДеревоКлассификатораЕдиницИзмерения = ПолучитьДанныеКлассификатора();
	
	ТаблицаКлассификатораЕдиницИзмерения = Новый ТаблицаЗначений;
	ТаблицаКлассификатораЕдиницИзмерения.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ТаблицаКлассификатораЕдиницИзмерения.Колонки.Добавить("КодЧисловой", Новый ОписаниеТипов("Строка"));
	ТаблицаКлассификатораЕдиницИзмерения.Колонки.Добавить("ТипИзмеряемойВеличины", Новый ОписаниеТипов("Строка"));
	ТаблицаКлассификатораЕдиницИзмерения.Колонки.Добавить("УсловноеОбозначениеНациональное", Новый ОписаниеТипов("Строка"));
	ТаблицаКлассификатораЕдиницИзмерения.Колонки.Добавить("УсловноеОбозначениеМеждународное", Новый ОписаниеТипов("Строка"));
	ТаблицаКлассификатораЕдиницИзмерения.Колонки.Добавить("КодовоеБуквенноеОбозначениеНациональное", Новый ОписаниеТипов("Строка"));
	ТаблицаКлассификатораЕдиницИзмерения.Колонки.Добавить("КодовоеБуквенноеОбозначениеМеждународное", Новый ОписаниеТипов("Строка"));
	
	ПреобразованиеДеревоКлассификатораЕдиницВТаблицу(ДеревоКлассификатораЕдиницИзмерения, ТаблицаКлассификатораЕдиницИзмерения);
	
	Возврат ТаблицаКлассификатораЕдиницИзмерения;
	
КонецФункции

// Преобразует дерево классификатора единиц измерения в таблицу значений.
//
// Параметры:
//  ДеревоЗначений - ДеревоЗначений - Дерево классификатора единиц измерения.
//  ТаблицаЗначений - ТаблицаЗначений - Таблица значений, в которую будут помещены данные из дерева.
//
Процедура ПреобразованиеДеревоКлассификатораЕдиницВТаблицу(ДеревоЗначений, ТаблицаЗначений) Экспорт
	
	Для Каждого СтрокаДерева Из ДеревоЗначений.Строки Цикл
		
		НоваяСтрокаТаблицы = ТаблицаЗначений.Добавить();
		НоваяСтрокаТаблицы.Наименование = СтрокаДерева.Наименование;
		НоваяСтрокаТаблицы.КодЧисловой = СтрокаДерева.КодЧисловой;
		НоваяСтрокаТаблицы.ТипИзмеряемойВеличины = СтрокаДерева.ТипИзмеряемойВеличины;
		НоваяСтрокаТаблицы.УсловноеОбозначениеНациональное = СтрокаДерева.УсловноеОбозначениеНациональное;
		НоваяСтрокаТаблицы.УсловноеОбозначениеМеждународное = СтрокаДерева.УсловноеОбозначениеМеждународное;
		НоваяСтрокаТаблицы.КодовоеБуквенноеОбозначениеНациональное = СтрокаДерева.КодовоеБуквенноеОбозначениеНациональное;
		НоваяСтрокаТаблицы.КодовоеБуквенноеОбозначениеМеждународное = СтрокаДерева.КодовоеБуквенноеОбозначениеМеждународное;
		
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ПреобразованиеДеревоКлассификатораЕдиницВТаблицу(СтрокаДерева, ТаблицаЗначений);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизиты объекта справочника "Единицы измерения" по данным выборки.
//
// Параметры:
//  СправочникОбъект - СправочникОбъект.ЕдиницыИзмерения - Объект справочника "Единицы измерения".
//  СправочникВыборка - ВыборкаИзРезультатаЗапроса - Выборка данных для заполнения объекта.
//
Процедура ЗаполнитьОбъектЕдиницыИзмерения(СправочникОбъект, СправочникВыборка) Экспорт
	
	СправочникОбъект.Наименование = НаименованиеЕдиницыИзмерения(СправочникВыборка);
	СправочникОбъект.МеждународноеСокращение = СтрЗаменить(СправочникВыборка.КодовоеБуквенноеОбозначениеМеждународное,
		Символы.ПС, "/");
	СправочникОбъект.НаименованиеПолное = СтрЗаменить(СправочникВыборка.Наименование,Символы.ПС,"/");
	СправочникОбъект.Код = СокрЛП(СправочникВыборка.КодЧисловой);
	
	Если ЗначениеЗаполнено(СправочникВыборка.ТипИзмеряемойВеличины) Тогда
		СправочникОбъект.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин[СправочникВыборка.ТипИзмеряемойВеличины];
	КонецЕсли;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт

	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;

КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "шт";
	Элемент.Наименование = НСтр("ru='шт'");
	Элемент.НаименованиеПолное = "Штука";
	Элемент.МеждународноеСокращение = "PCE";
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ч";
	Элемент.Наименование = НСтр("ru='ч'");
	Элемент.НаименованиеПолное = "Час";
	Элемент.МеждународноеСокращение = "HUR";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
	// Если задана связь параметров выбора по значению номенклатуры,
	// то данные выбора получим из справочника "ЕдиницыИзмерения".
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Справочники.ЕдиницыИзмерения.ПолучитьДанныеВыбора(Параметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЕдиницаИзмерения

Функция НаименованиеЕдиницыИзмерения(Знач СтрокаУровень3)
	
	Если ЗначениеЗаполнено(СтрокаУровень3.УсловноеОбозначениеНациональное) Тогда
		Результат = СтрокаУровень3.УсловноеОбозначениеНациональное;
	ИначеЕсли ЗначениеЗаполнено(СтрокаУровень3.УсловноеОбозначениеМеждународное) Тогда
		Результат = СтрокаУровень3.УсловноеОбозначениеМеждународное;
	ИначеЕсли ЗначениеЗаполнено(СтрокаУровень3.КодовоеБуквенноеОбозначениеНациональное) Тогда
		Результат = СтрокаУровень3.КодовоеБуквенноеОбозначениеНациональное;
	ИначеЕсли ЗначениеЗаполнено(СтрокаУровень3.КодовоеБуквенноеОбозначениеМеждународное) Тогда
		Результат = СтрокаУровень3.КодовоеБуквенноеОбозначениеМеждународное;
	Иначе
		Результат = СтрокаУровень3.Наименование;
	КонецЕсли;
	
	Возврат СтрЗаменить(Результат, Символы.ПС, "/");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
